IMProject/IMBootloader/Middlewares/ST/STM32_ExtMem_Manager/sal/stm32_sal_xspi.c
/**
  ******************************************************************************
  * @file   stm32_sal_xspi.c
  * @author  MCD Application Team
  * @brief   This file is the software adaptation layer for XSPI
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32_extmem.h"
#include "stm32_extmem_conf.h"
#if EXTMEM_SAL_XSPI_DEBUG_LEVEL != 0 && defined(EXTMEM_MACRO_DEBUG)
#include <stdio.h>
#endif /*EXTMEM_SAL_XSPI_DEBUG_LEVEL != 0 && defined(EXTMEM_MACRO_DEBUG)*/

#if EXTMEM_SAL_XSPI == 1
#include "stm32_sal_xspi_type.h"
#include "stm32_sal_xspi_api.h"

/** @defgroup SAL_XSPI SAL_XSPI : Software adaptation layer for XSPI
  * @ingroup EXTMEM_SAL
  * @{
  */

/* Private Macros ------------------------------------------------------------*/
/** @defgroup SAL_XSPI_Private_Macros SAL XSPI Private Macros
  * @{
  */

#if EXTMEM_SAL_XSPI_DEBUG_LEVEL == 0 || !defined(EXTMEM_MACRO_DEBUG)
#define DEBUG_PARAM_BEGIN()
#define DEBUG_PARAM_DATA(_STR_)
#define DEBUG_PARAM_INT(_INT_ )
#define DEBUG_PARAM_INTD(_INT_ )
#define DEBUG_PARAM_END()
#define DEBUG_AUTOPOLLING(_DR_,_MVAL_,_MMASK_)
#define STR_PHY_LINK(_PHY_)
#else
/**
  * @brief trace header macro
  */
#define DEBUG_PARAM_BEGIN()     EXTMEM_MACRO_DEBUG("\t\tSALXSPI::");

const uint8_t phylink_string[][17] = {"PHY_LINK_1S1S1S",
                                      "PHY_LINK_1S1S2S",
                                      "PHY_LINK_1S2S2S",
                                      "PHY_LINK_1S1D1D",
                                      "PHY_LINK_4S4S4S",
                                      "PHY_LINK_4S4D4D",
                                      "PHY_LINK_4D4D4D",
                                      "PHY_LINK_1S8S8S",
                                      "PHY_LINK_8S8D8D",
                                      "PHY_LINK_8D8D8D",
                                      "PHY_LINK_RAM8"
#if defined(HAL_XSPI_DATA_16_LINES)
                                      ,"PHY_LINK_RAM16"
#endif /* defined(HAL_XSPI_DATA_16_LINES) */
									  };

#define STR_PHY_LINK(_PHY_)  phylink_string[_PHY_]

/**
  * @brief trace data string macro
  */
#define DEBUG_PARAM_DATA(_STR_) EXTMEM_MACRO_DEBUG(_STR_);

/**
  * @brief trace data integer macro
  */
#define DEBUG_PARAM_INT(_INT_) {                                                 \
                                 char str[10];                                   \
                                 (void)snprintf(str, sizeof(str), "0x%x", _INT_);\
                                 EXTMEM_MACRO_DEBUG(str);                        \
                               }
#define DEBUG_PARAM_INTD(_INT_) {                                                \
                                  char str[15];                                  \
                                  (void)snprintf(str, sizeof(str), "%zu", _INT_);\
                                  EXTMEM_MACRO_DEBUG(str);                       \
                                }
/**
  * @brief trace close macro
  */
#define DEBUG_PARAM_END()       EXTMEM_MACRO_DEBUG("\n");

#if EXTMEM_SAL_XSPI_DEBUG_LEVEL == 2
#define DEBUG_AUTOPOLLING(_DR_,_MVAL_,_MMASK_)                                                    \
  {                                                                                               \
    char str[50];                                                                                 \
    (void)snprintf(str, sizeof(str),"DR:0x%x::MVal:0x%x::MMask:0x%x\n\r", _DR_, _MVAL_, _MMASK_); \
    DEBUG_PARAM_BEGIN()                                                                           \
    DEBUG_PARAM_DATA(str)                                                                         \
    DEBUG_PARAM_END()                                                                             \
  }
#else
#define DEBUG_AUTOPOLLING(_DR_,_MVAL_,_MMASK_)
#endif /* EXTMEM_SAL_XSPI_DEBUG_LEVEL == 2 */
#endif /* EXTMEM_SAL_XSPI_DEBUG_LEVEL == 0 || !defined(EXTMEM_MACRO_DEBUG) */

/**
  * @brief default SAL timeout (100 ms)
  */

#define SAL_XSPI_TIMEOUT_DEFAULT_VALUE (100U)

/**
  * @}
  */

#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
/** @defgroup SAL_XSPI_Private_Transfer SAL XSPI Dma transfer management definition
  * @{
  */
/**
  * @brief state of the transfer status
  */
typedef enum {
  SALXSPI_TRANSFER_NONE, /*!< */
  SALXSPI_TRANSFER_OK,
  SALXSPI_TRANSFER_ERROR
}SAL_XSPI_TRANSFER_STATUS;

/**
  * @brief variable of the transfer status
  */
volatile SAL_XSPI_TRANSFER_STATUS salXSPI_status = SALXSPI_TRANSFER_NONE;

/**
  * @}
  */
#endif /* (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */

/* Private typedefs ---------------------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/** @defgroup SAL_XSPI_Private_Functions SAL XSP Private Functions
  * @{
  */
uint16_t XSPI_FormatCommand(uint8_t CommandExtension, uint32_t InstructionWidth, uint8_t Command);
HAL_StatusTypeDef XSPI_Transmit(SAL_XSPI_ObjectTypeDef *SalXspi, const uint8_t *Data);
HAL_StatusTypeDef XSPI_Receive(SAL_XSPI_ObjectTypeDef *SalXspi,  uint8_t *Data);
#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
void SAL_XSPI_ErrorCallback(struct __XSPI_HandleTypeDef *hxspi);
void SAL_XSPI_CompleteCallback(struct __XSPI_HandleTypeDef *hxspi);
#endif /* (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */

/**
  * @}
  */

