IMProject/IMBootloader/Middlewares/ST/STM32_ExtMem_Manager/sal/stm32_sal_xspi.c
/* Exported variables ---------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/** @defgroup SAL_XSPI_Exported_Functions SAL XSP Exported Functions
  * @{
  */
HAL_StatusTypeDef SAL_XSPI_SetClock(SAL_XSPI_ObjectTypeDef *SalXspi, uint32_t ClockIn, uint32_t ClockRequested, uint32_t *ClockReal)
{
  HAL_StatusTypeDef retr = HAL_OK;
  uint32_t divider;

  if (ClockRequested == 0u)
  {
    retr = HAL_ERROR;
  }
  else
  {
    divider = (ClockIn / ClockRequested);
    if (divider >= 1u)
    {
      *ClockReal = ClockIn / divider;
      if (*ClockReal <= ClockRequested)
      {
        divider--;
      }
    }

    /* real clock calculation */
    *ClockReal = ClockIn / (divider + 1u);

    DEBUG_PARAM_BEGIN(); DEBUG_PARAM_DATA("::CLOCKDIV::"); DEBUG_PARAM_INT(divider+1); DEBUG_PARAM_END();
    DEBUG_PARAM_BEGIN(); DEBUG_PARAM_DATA("::CLKFREQ::"); DEBUG_PARAM_INTD(*ClockReal); DEBUG_PARAM_END();
    MODIFY_REG(SalXspi->hxspi->Instance->DCR2, XSPI_DCR2_PRESCALER, (uint32_t)divider << XSPI_DCR2_PRESCALER_Pos);
  }

  return retr;
}

/*
* This function is used to configure the way to discuss with the memory
*
*/
HAL_StatusTypeDef SAL_XSPI_Init(SAL_XSPI_ObjectTypeDef *SalXspi, void *HALHandle)
{
  XSPI_RegularCmdTypeDef s_commandbase = {
      .OperationType = HAL_XSPI_OPTYPE_COMMON_CFG,
      .IOSelect = HAL_XSPI_SELECT_IO_7_0,
      .InstructionMode = HAL_XSPI_INSTRUCTION_1_LINE,
      .Instruction = EXTMEM_READ_SFDP_COMMAND,
      .InstructionWidth = HAL_XSPI_INSTRUCTION_8_BITS,
      .InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_DISABLE,
      .AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE,
      .AddressMode = HAL_XSPI_ADDRESS_1_LINE,
      .AddressWidth = HAL_XSPI_ADDRESS_24_BITS,
      .Address = 0x0,
      .AddressDTRMode = HAL_XSPI_ADDRESS_DTR_DISABLE,
      .DataMode = HAL_XSPI_DATA_1_LINE,
      .DataLength = 0x0,
      .DataDTRMode = HAL_XSPI_DATA_DTR_DISABLE,
      .DummyCycles = EXTMEM_READ_SFDP_NB_DUMMY_CYCLES_DEFAULT,
      .DQSMode = HAL_XSPI_DQS_DISABLE,
#if defined(XSPI_CCR_SIOO)
      .SIOOMode = HAL_XSPI_SIOO_INST_EVERY_CMD,
#endif /* HAL_XSPI_SIOO_INST_EVERY_CMD */
  };

  SalXspi->hxspi = (XSPI_HandleTypeDef *)HALHandle;
  SalXspi->Commandbase = s_commandbase;
  SalXspi->CommandExtension = 0;
  SalXspi->PhyLink = PHY_LINK_1S1S1S;

#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
  /* set completion call back */
  HAL_XSPI_RegisterCallback(SalXspi->hxspi,HAL_XSPI_RX_CPLT_CB_ID, SAL_XSPI_CompleteCallback);
  HAL_XSPI_RegisterCallback(SalXspi->hxspi,HAL_XSPI_TX_CPLT_CB_ID, SAL_XSPI_CompleteCallback);
  /* set the error callback */
  HAL_XSPI_RegisterCallback(SalXspi->hxspi,HAL_XSPI_ERROR_CB_ID, SAL_XSPI_ErrorCallback);
#endif /* (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */

  return HAL_OK;
}

HAL_StatusTypeDef SAL_XSPI_MemoryConfig(SAL_XSPI_ObjectTypeDef *SalXspi, SAL_XSPI_MemParamTypeTypeDef ParametersType, void *ParamVal)
{
  HAL_StatusTypeDef retr = HAL_OK;
  XSPI_RegularCmdTypeDef s_commandbase = SalXspi->Commandbase;

  switch (ParametersType) {
  case PARAM_PHY_LINK:{
    SalXspi->PhyLink = *((SAL_XSPI_PhysicalLinkTypeDef *)ParamVal);
    DEBUG_PARAM_BEGIN(); DEBUG_PARAM_DATA("::PARAM_PHY_LINK::");DEBUG_PARAM_DATA(STR_PHY_LINK(SalXspi->PhyLink));
    switch (SalXspi->PhyLink)
    {
    case PHY_LINK_1S1D1D:
    case PHY_LINK_1S2S2S:
    case PHY_LINK_1S1S2S:
    case PHY_LINK_1S1S1S: {
      s_commandbase.InstructionMode = HAL_XSPI_INSTRUCTION_1_LINE;
      s_commandbase.InstructionWidth = HAL_XSPI_INSTRUCTION_8_BITS;
      s_commandbase.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_DISABLE;
      s_commandbase.AddressMode = HAL_XSPI_ADDRESS_1_LINE;
      s_commandbase.AddressWidth = HAL_XSPI_ADDRESS_24_BITS;
      s_commandbase.AddressDTRMode = HAL_XSPI_ADDRESS_DTR_DISABLE;
      s_commandbase.DataMode = HAL_XSPI_DATA_1_LINE;
      s_commandbase.DataDTRMode = HAL_XSPI_DATA_DTR_DISABLE;
      s_commandbase.DummyCycles = 8;
      s_commandbase.DQSMode = HAL_XSPI_DQS_DISABLE;
      break;
    }

    case PHY_LINK_4S4D4D:
    case PHY_LINK_4S4S4S: {
      s_commandbase.InstructionMode = HAL_XSPI_INSTRUCTION_4_LINES;
      s_commandbase.InstructionWidth = HAL_XSPI_INSTRUCTION_8_BITS;
      s_commandbase.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_DISABLE;
      s_commandbase.AddressMode = HAL_XSPI_ADDRESS_4_LINES;
      s_commandbase.AddressDTRMode = HAL_XSPI_ADDRESS_DTR_DISABLE;
      s_commandbase.AddressWidth = HAL_XSPI_ADDRESS_24_BITS;
      s_commandbase.DataMode = HAL_XSPI_DATA_4_LINES;
      s_commandbase.DataDTRMode = HAL_XSPI_DATA_DTR_DISABLE;
      s_commandbase.DummyCycles = 6;
      s_commandbase.DQSMode = HAL_XSPI_DQS_DISABLE;
      break;
      }
    case PHY_LINK_4D4D4D: {
      s_commandbase.InstructionMode = HAL_XSPI_INSTRUCTION_4_LINES;
      s_commandbase.InstructionWidth = HAL_XSPI_INSTRUCTION_8_BITS;
      s_commandbase.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_ENABLE;
      s_commandbase.AddressMode = HAL_XSPI_ADDRESS_4_LINES;
      s_commandbase.AddressWidth = HAL_XSPI_ADDRESS_24_BITS;
      s_commandbase.AddressDTRMode = HAL_XSPI_ADDRESS_DTR_ENABLE;
      s_commandbase.DataMode = HAL_XSPI_DATA_4_LINES;
      s_commandbase.DataDTRMode = HAL_XSPI_DATA_DTR_ENABLE;
      s_commandbase.DummyCycles = 6;
      s_commandbase.DQSMode = HAL_XSPI_DQS_DISABLE;
      break;
    }
    case PHY_LINK_1S8S8S: {
      s_commandbase.InstructionMode = HAL_XSPI_INSTRUCTION_1_LINE;
      s_commandbase.InstructionWidth = HAL_XSPI_INSTRUCTION_8_BITS;
      s_commandbase.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_DISABLE;
      s_commandbase.AddressMode = HAL_XSPI_ADDRESS_8_LINES;
      s_commandbase.AddressWidth = HAL_XSPI_ADDRESS_32_BITS;
      s_commandbase.AddressDTRMode = HAL_XSPI_ADDRESS_DTR_DISABLE;
      s_commandbase.DataMode = HAL_XSPI_DATA_8_LINES;
      s_commandbase.DataDTRMode = HAL_XSPI_DATA_DTR_DISABLE;
      s_commandbase.DummyCycles = 8;
      s_commandbase.DQSMode = HAL_XSPI_DQS_DISABLE;
      break;
    }
    case PHY_LINK_8S8D8D: {
      s_commandbase.InstructionMode = HAL_XSPI_INSTRUCTION_8_LINES;
      s_commandbase.InstructionWidth = HAL_XSPI_INSTRUCTION_8_BITS;
      s_commandbase.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_DISABLE;
      s_commandbase.AddressMode = HAL_XSPI_ADDRESS_8_LINES;
      s_commandbase.AddressWidth = HAL_XSPI_ADDRESS_32_BITS;
      s_commandbase.AddressDTRMode = HAL_XSPI_ADDRESS_DTR_ENABLE;
      s_commandbase.DataMode = HAL_XSPI_DATA_8_LINES;
      s_commandbase.DataDTRMode = HAL_XSPI_DATA_DTR_ENABLE;
      s_commandbase.DummyCycles = 8;
      s_commandbase.DQSMode = HAL_XSPI_DQS_ENABLE;
      break;
    }

    case PHY_LINK_8D8D8D: {
      s_commandbase.InstructionMode = HAL_XSPI_INSTRUCTION_8_LINES;
      s_commandbase.InstructionWidth = HAL_XSPI_INSTRUCTION_16_BITS;
      s_commandbase.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_ENABLE;
      s_commandbase.AddressMode = HAL_XSPI_ADDRESS_8_LINES;
      s_commandbase.AddressWidth = HAL_XSPI_ADDRESS_32_BITS;
      s_commandbase.AddressDTRMode = HAL_XSPI_ADDRESS_DTR_ENABLE;
      s_commandbase.DataMode = HAL_XSPI_DATA_8_LINES;
      s_commandbase.DataDTRMode = HAL_XSPI_DATA_DTR_ENABLE;
      s_commandbase.DummyCycles = 20;
      s_commandbase.DQSMode = HAL_XSPI_DQS_ENABLE;
      break;
    }
    case PHY_LINK_RAM8:{
      s_commandbase.InstructionMode    = HAL_XSPI_INSTRUCTION_8_LINES;
      s_commandbase.InstructionWidth   = HAL_XSPI_INSTRUCTION_8_BITS;
      s_commandbase.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_DISABLE;
      s_commandbase.AddressMode        = HAL_XSPI_ADDRESS_8_LINES;
      s_commandbase.AddressWidth       = HAL_XSPI_ADDRESS_32_BITS;
      s_commandbase.AddressDTRMode     = HAL_XSPI_ADDRESS_DTR_ENABLE;
      s_commandbase.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
      s_commandbase.DataMode           = HAL_XSPI_DATA_8_LINES;
      s_commandbase.DataDTRMode        = HAL_XSPI_DATA_DTR_ENABLE;
      s_commandbase.DummyCycles        = 10;
      s_commandbase.DQSMode            = HAL_XSPI_DQS_ENABLE;
      break;
    }
#if defined(HAL_XSPI_DATA_16_LINES)
    case PHY_LINK_RAM16 :{
      s_commandbase.InstructionMode    = HAL_XSPI_INSTRUCTION_8_LINES;
      s_commandbase.InstructionWidth   = HAL_XSPI_INSTRUCTION_8_BITS;
      s_commandbase.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_DISABLE;
      s_commandbase.AddressMode        = HAL_XSPI_ADDRESS_8_LINES;
      s_commandbase.AddressWidth       = HAL_XSPI_ADDRESS_32_BITS;
      s_commandbase.AddressDTRMode     = HAL_XSPI_ADDRESS_DTR_ENABLE;
      s_commandbase.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
      s_commandbase.DataMode           = HAL_XSPI_DATA_16_LINES;
      s_commandbase.DataDTRMode        = HAL_XSPI_DATA_DTR_ENABLE;
      s_commandbase.DummyCycles        = 10;
      s_commandbase.DQSMode            = HAL_XSPI_DQS_ENABLE;
      break;
    }
#endif /* defined(HAL_XSPI_DATA_16_LINES) */
    default:
      retr = HAL_ERROR;
      break;
    }
    DEBUG_PARAM_END();
    break;
  }
  case PARAM_ADDRESS_4BYTES: {
    DEBUG_PARAM_BEGIN(); DEBUG_PARAM_DATA("::PARAM_ADDRESS_4BYTES"); DEBUG_PARAM_END();
    s_commandbase.AddressWidth = HAL_XSPI_ADDRESS_32_BITS;
    break;
  }
  case PARAM_FLASHSIZE:{
    uint8_t valParam = *((uint8_t *)ParamVal);
    DEBUG_PARAM_BEGIN(); DEBUG_PARAM_DATA("::PARAM_FLASHSIZE::"); DEBUG_PARAM_INT(valParam); DEBUG_PARAM_END();
    MODIFY_REG(SalXspi->hxspi->Instance->DCR1, XSPI_DCR1_DEVSIZE, ((uint32_t)valParam) << XSPI_DCR1_DEVSIZE_Pos);
    break;
  }
  case PARAM_DUMMY_CYCLES:{
    uint8_t valParam = *((uint8_t *)ParamVal);
    DEBUG_PARAM_BEGIN(); DEBUG_PARAM_DATA("::PARAM_DUMMY_CYCLES::"); DEBUG_PARAM_INT(valParam); DEBUG_PARAM_END();
    s_commandbase.DummyCycles = valParam;
    break;
  }
  default:
    DEBUG_PARAM_BEGIN(); DEBUG_PARAM_DATA("::SAL_XSPI_MemoryConfig::ERROR"); DEBUG_PARAM_END();
    retr = HAL_ERROR;
    break;
  }
  SalXspi->Commandbase = s_commandbase;
  return retr;
}

HAL_StatusTypeDef SAL_XSPI_GetSFDP(SAL_XSPI_ObjectTypeDef *SalXspi, uint32_t Address, uint8_t *Data, uint32_t DataSize)
{
  HAL_StatusTypeDef retr;
  XSPI_RegularCmdTypeDef s_command = SalXspi->Commandbase;

